Tekla Open API Reference for Tekla Structures 2025
OkCancel Events
The OkCancel type exposes the following members.
Events
Name | Description
CancelClicked
 The CancelClicked event is raised when the Cancel button is clicked.
OkClicked
 The OkClicked event is raised when the Ok button is clicked.
Top
See Also
Reference
OkCancel Class
Tekla.Structures.Dialog.UIControls Namespace